Documents/ДневнойОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДневнойОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>InformationRegister.ДокументыПродажи</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходСуммаРозн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходСуммаРозн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПараметрыУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьНаЗатратыПоПриходу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяЗатратПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияОбслуживанияПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>УсловияОбслуживанияПокупателей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РекомендованныйТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НаправленияДвижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>НаправленияДвижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дегустация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБонусами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходТоваровНТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПриходТоваровНТТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДневнойОтчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		Параметры.ЗначенияЗаполнения
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОтделПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("Подразделение", 	СтруктураДанные.Отдел.Подразделение);
	СтруктураДанные.Вставить("Магазин", 		СтруктураДанные.Отдел.Магазин);
	
	Возврат (СтруктураДанные);
	
КонецФункции

&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Отдел", ЭтаФорма.Объект.Отдел);
	
	СтруктураДанные = ПолучитьДанныеОтделПриИзменении(СтруктураДанные);

	Объект.Подразделение 	= СтруктураДанные.Подразделение;
	Объект.Магазин 			= СтруктураДанные.Магазин;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюКолонок()
	
	НаправлениеДвижения = Элементы.СтрокиДокумента.ТекущиеДанные.НаправлениеДвижения;
	
	Элементы.СтрокиДокументаРасходСумма.Доступность = Истина;
	Элементы.СтрокиДокументаПриходСумма.Доступность = Истина;
	
	Элементы.СтрокиДокументаГруппа1Приход.Доступность = Ложь;
	Элементы.СтрокиДокументаГруппа1Расход.Доступность = Ложь;
	
	Если НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.ВозвратПоставщику") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.ЗакупкаТовара") Тогда
		
		Элементы.СтрокиДокументаГруппа1Приход.Доступность = Истина;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.ПолучениеКредита") Тогда
		
		Элементы.СтрокиДокументаГруппа1Приход.Доступность = Истина;
		Элементы.СтрокиДокументаПриходСумма.Доступность = Ложь;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.НаРасходы") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		Элементы.СтрокиДокументаРасходСумма.Доступность = Ложь;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.Инкассация") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		Элементы.СтрокиДокументаРасходСумма.Доступность = Ложь;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.ВозвратКредита") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		Элементы.СтрокиДокументаРасходСумма.Доступность = Ложь;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.Уценка") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.Дооценка") Тогда
		
		Элементы.СтрокиДокументаГруппа1Приход.Доступность = Истина;
		Элементы.СтрокиДокументаПриходСумма.Доступность = Ложь;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.Недостачи") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		
	ИначеЕсли НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.НаправленияДвижения.ОплатаПоставщику") Тогда
		
		Элементы.СтрокиДокументаГруппа1Расход.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СтрокиДокументаПриАктивизацииПоля(элемент)
	
	Если Найти("СтрокиДокументаПриходСумма, СтрокиДокументаПриходСуммаРозн, СтрокиДокументаРасходСумма, СтрокиДокументаРасходСуммаРозн", элемент.ТекущийЭлемент.Имя ) > 0 Тогда
		УправлениеДоступностьюКолонок();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтчетСервер()
	
	УстановитьПривилегированныйРежим(Истина);
	
	строкиДокумента = Объект.СтрокиДокумента.Выгрузить();
	
	сообщить(СтрокиДокумента.Количество());
	
	Объект.СтрокиДокумента.Очистить();
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса

	запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокиДокумента.НаправлениеДвижения,
	|	СтрокиДокумента.Объект,
	|	СтрокиДокумента.Комментарий,
	|	СтрокиДокумента.ПриходСумма,
	|	СтрокиДокумента.ПриходСуммаРозн,
	|	СтрокиДокумента.РасходСумма,
	|	СтрокиДокумента.РасходСуммаРозн,
	|	СтрокиДокумента.АвтоЗаполнение
	|ПОМЕСТИТЬ СтрокиДокумента
	|ИЗ
	|	&СтрокиДокумента КАК СтрокиДокумента
	|ГДЕ
	|	СтрокиДокумента.АвтоЗаполнение = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокИсключаемыхНакладных
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаНоменклатуры.СрезПоследних(НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ), Подразделение = &Подразделение) КАК ПараметрыУчетаНоменклатурыСрезПоследних
	|		ПО РасходнаяНакладнаяЗапасы.Номенклатура = ПараметрыУчетаНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ПараметрыУчетаНоменклатурыСрезПоследних.СписыватьНаЗатратыПоПриходу, ЛОЖЬ) = ИСТИНА
	|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасходнаяНакладнаяЗапасы.Ссылка.Проведен = ИСТИНА
	|	И РасходнаяНакладнаяЗапасы.Ссылка.Контрагент = &Магазин
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателяЗапасы.Ссылка
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаНоменклатуры.СрезПоследних(НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ), Подразделение = &Подразделение) КАК ПараметрыУчетаНоменклатурыСрезПоследних
	|		ПО ВозвратОтПокупателяЗапасы.Номенклатура = ПараметрыУчетаНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ПараметрыУчетаНоменклатурыСрезПоследних.СписыватьНаЗатратыПоПриходу, ЛОЖЬ) = ИСТИНА
	|	И ВозвратОтПокупателяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратОтПокупателяЗапасы.Ссылка.Проведен = ИСТИНА
	|	И ВозвратОтПокупателяЗапасы.Ссылка.Контрагент = &Магазин
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЗапасы.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ЗакупкаТовара) КАК НаправлениеДвижения,
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент КАК Объект,
	|	РасходнаяНакладная.Номер КАК Комментарий,
	|	РасходнаяНакладная.СуммаДокумента КАК ПриходСумма,
	|	РасходнаяНакладная.СуммаДокумента + РасходнаяНакладная.СуммаСкидки КАК ПриходСуммаРозн,
	|	0 КАК РасходСумма,
	|	0 КАК РасходСуммаРозн,
	|	ИСТИНА КАК АвтоЗаполнение
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|		ПО РасходнаяНакладная.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОбслуживанияПокупателей.СрезПоследних(&ДатаСреза, ) КАК УсловияОбслуживанияПокупателейСрезПоследних
	|		ПО РасходнаяНакладная.Контрагент = УсловияОбслуживанияПокупателейСрезПоследних.Контрагент
	|ГДЕ
	|	РасходнаяНакладная.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасходнаяНакладная.Проведен = ИСТИНА
	|	И РасходнаяНакладная.Контрагент = &Магазин
	|	И ВЫБОР
	|			КОГДА &ЕстьОрганизация
	|				ТОГДА РасходнаяНакладная.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЕСТЬNULL(УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен, ЗНАЧЕНИЕ(справочник.ТипыЦен.ПустаяСсылка)) = ЗНАЧЕНИЕ(справочник.ТипыЦен.ПустаяСсылка)
	|	И НЕ РасходнаяНакладная.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_СписокИсключаемыхНакладных.Ссылка
	|				ИЗ
	|					ВТ_СписокИсключаемыхНакладных КАК ВТ_СписокИсключаемыхНакладных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ЗакупкаТовара),
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент,
	|	ПриходТоваровНТТ.Номер,
	|	ПриходТоваровНТТ.СуммаДокумента,
	|	ПриходТоваровНТТ.СуммаБезСкидки,
	|	0,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПриходТоваровНТТ КАК ПриходТоваровНТТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|		ПО ПриходТоваровНТТ.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|ГДЕ
	|	ПриходТоваровНТТ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриходТоваровНТТ.Проведен = ИСТИНА
	|	И ПриходТоваровНТТ.Отдел = &Отдел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ЗакупкаТовара),
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Номер,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента,
	|	СУММА(ПриходнаяНакладнаяЗапасы.Количество * ЦеныНоменклатурыСрезПоследних.Цена),
	|	0,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаСреза,
	|				Подразделение = &Подразделение
	|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПриходнаяНакладнаяЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.Проведен = ИСТИНА
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.ЦФО = &Отдел
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Номер,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ВозвратПоставщику),
	|	ВозвратПоставщикуЗапасы.Ссылка.Контрагент,
	|	ВозвратПоставщикуЗапасы.Ссылка.Номер,
	|	0,
	|	0,
	|	ВозвратПоставщикуЗапасы.Ссылка.СуммаДокумента,
	|	СУММА(ВозвратПоставщикуЗапасы.Количество * ЦеныНоменклатурыСрезПоследних.Цена),
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратПоставщику.Запасы КАК ВозвратПоставщикуЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаСреза,
	|				Подразделение = &Подразделение
	|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВозвратПоставщикуЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ВозвратПоставщикуЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратПоставщикуЗапасы.Ссылка.Проведен = ИСТИНА
	|	И ВозвратПоставщикуЗапасы.Ссылка.ЦФО = &Отдел
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратПоставщикуЗапасы.Ссылка.Контрагент,
	|	ВозвратПоставщикуЗапасы.Ссылка.Номер,
	|	ВозвратПоставщикуЗапасы.Ссылка.СуммаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ВозвратПоставщику),
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент,
	|	ВозвратОтПокупателя.ДокОсн.Номер,
	|	0,
	|	0,
	|	ВозвратОтПокупателя.СуммаДокумента,
	|	ВозвратОтПокупателя.СуммаДокумента + ВозвратОтПокупателя.СуммаСкидки,
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|		ПО ВозвратОтПокупателя.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОбслуживанияПокупателей.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ), ) КАК УсловияОбслуживанияПокупателейСрезПоследних
	|		ПО ВозвратОтПокупателя.Контрагент = УсловияОбслуживанияПокупателейСрезПоследних.Контрагент
	|ГДЕ
	|	ВозвратОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратОтПокупателя.Проведен = ИСТИНА
	|	И ВозвратОтПокупателя.Контрагент = &Магазин
	|	И ВЫБОР
	|			КОГДА &ЕстьОрганизация
	|				ТОГДА ВозвратОтПокупателя.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЕСТЬNULL(УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
	|	И НЕ ВозвратОтПокупателя.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_СписокИсключаемыхНакладных.Ссылка
	|				ИЗ
	|					ВТ_СписокИсключаемыхНакладных КАК ВТ_СписокИсключаемыхНакладных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ВозвратПоставщику),
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент,
	|	ВозвратТоваровНТТ.Номер,
	|	0,
	|	0,
	|	ВозвратТоваровНТТ.СуммаДокумента,
	|	ВозвратТоваровНТТ.СуммаБезСкидки,
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратТоваровНТТ КАК ВозвратТоваровНТТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|		ПО ВозвратТоваровНТТ.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|ГДЕ
	|	ВозвратТоваровНТТ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратТоваровНТТ.Проведен = ИСТИНА
	|	И ВозвратТоваровНТТ.Отдел = &Отдел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.Инкассация),
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент,
	|	"""",
	|	0,
	|	0,
	|	0,
	|	ПоступлениеДенег.СуммаДокумента,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПоступлениеДенег КАК ПоступлениеДенег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|		ПО ПоступлениеДенег.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|ГДЕ
	|	ПоступлениеДенег.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеДенег.Проведен = ИСТИНА
	|	И ПоступлениеДенег.ЦФО = &Отдел
	|	И ПоступлениеДенег.ОперацияДокумента = ЗНАЧЕНИЕ(Справочник.ОперацииДокументов.ПоступлениеДенегИнкассация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтрокиДокумента.НаправлениеДвижения,
	|	СтрокиДокумента.Объект,
	|	СтрокиДокумента.Комментарий,
	|	СтрокиДокумента.ПриходСумма,
	|	СтрокиДокумента.ПриходСуммаРозн,
	|	СтрокиДокумента.РасходСумма,
	|	СтрокиДокумента.РасходСуммаРозн,
	|	СтрокиДокумента.АвтоЗаполнение
	|ИЗ
	|	СтрокиДокумента КАК СтрокиДокумента
	|ГДЕ
	|	СтрокиДокумента.АвтоЗаполнение = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.Дегустация),
	|	NULL,
	|	АктСписанияЗапасы.Ссылка.Номер,
	|	0,
	|	0,
	|	СУММА(АктСписанияЗапасы.Количество * ЦеныНоменклатурыСрезПоследних.Цена),
	|	АктСписанияЗапасы.Ссылка.СуммаДокумента,
	|	ИСТИНА
	|ИЗ
	|	Документ.АктСписания.Запасы КАК АктСписанияЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаСреза,
	|				Подразделение = &Подразделение
	|					И ТипЦен = &ТипЦенСебестоимость) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО АктСписанияЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	АктСписанияЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И АктСписанияЗапасы.Ссылка.Проведен = ИСТИНА
	|	И АктСписанияЗапасы.Ссылка.ЦФО = &Отдел
	|
	|СГРУППИРОВАТЬ ПО
	|	АктСписанияЗапасы.Ссылка.Номер,
	|	АктСписанияЗапасы.Ссылка.СуммаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	оплатыБонусами.НаправлениеДвижения,
	|	оплатыБонусами.Объект,
	|	оплатыБонусами.Комментарий,
	|	оплатыБонусами.ПриходСумма,
	|	оплатыБонусами.ПриходСуммаРозн,
	|	оплатыБонусами.РасходСумма,
	|	оплатыБонусами.РасходСуммаРозн,
	|	оплатыБонусами.АвтоЗаполнение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ОплатаБонусами) КАК НаправлениеДвижения,
	|		NULL КАК Объект,
	|		""оплата бонусами"" КАК Комментарий,
	|		СУММА(0) КАК ПриходСумма,
	|		СУММА(0) КАК ПриходСуммаРозн,
	|		СУММА(0) КАК РасходСумма,
	|		СУММА(Р_ПродажиПоБонуснымКартам.СуммаБонусовСписано) КАК РасходСуммаРозн,
	|		ИСТИНА КАК АвтоЗаполнение
	|	ИЗ
	|		РегистрНакопления.Р_ПродажиПоБонуснымКартам КАК Р_ПродажиПоБонуснымКартам
	|	ГДЕ
	|		Р_ПродажиПоБонуснымКартам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Р_ПродажиПоБонуснымКартам.ККР В
	|				(ВЫБРАТЬ
	|					Р_ПОСКассы.ККР
	|				ИЗ
	|					Справочник.Р_ПОС.Кассы КАК Р_ПОСКассы
	|				ГДЕ
	|					Р_ПОСКассы.Ссылка.ОтделВМагазине = &Отдел)) КАК оплатыБонусами
	|ГДЕ
	|	оплатыБонусами.РасходСуммаРозн <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	автоматическиеСкидки.НаправлениеДвижения,
	|	автоматическиеСкидки.Объект,
	|	автоматическиеСкидки.Комментарий,
	|	автоматическиеСкидки.ПриходСумма,
	|	автоматическиеСкидки.ПриходСуммаРозн,
	|	автоматическиеСкидки.РасходСумма,
	|	автоматическиеСкидки.РасходСуммаРозн,
	|	автоматическиеСкидки.АвтоЗаполнение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.Скидка) КАК НаправлениеДвижения,
	|		NULL КАК Объект,
	|		""авто-скидка"" КАК Комментарий,
	|		0 КАК ПриходСумма,
	|		0 КАК ПриходСуммаРозн,
	|		0 КАК РасходСумма,
	|		СУММА((ВЫРАЗИТЬ(ЧекККМТовары.Количество * ЧекККМТовары.Цена КАК ЧИСЛО(10, 2))) - ЧекККМТовары.Сумма) КАК РасходСуммаРозн,
	|		ИСТИНА КАК АвтоЗаполнение
	|	ИЗ
	|		Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Р_ПОС.Кассы КАК Р_ПОСКассы
	|			ПО ЧекККМТовары.Ссылка.Р_ПОС = Р_ПОСКассы.Ссылка
	|	ГДЕ
	|		ЧекККМТовары.Ссылка.Р_ПОС.ОтделВМагазине = &Отдел
	|		И ЧекККМТовары.Ссылка.Проведен = ИСТИНА
	|		И ЧекККМТовары.ПроцентСкидкиНаценки <> 0
	|		И ЧекККМТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
	|		И ЧекККМТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода) КАК автоматическиеСкидки
	|ГДЕ
	|	автоматическиеСкидки.РасходСуммаРозн <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ЗакупкаТовара),
	|	РасходныеНакладные.Объект,
	|	РасходныеНакладные.Комментарий,
	|	РасходныеНакладные.ПриходСумма,
	|	РасходныеНакладные.ПриходСуммаРозн,
	|	0,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент КАК Объект,
	|		РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Комментарий,
	|		СУММА(РасходнаяНакладнаяЗапасы.Сумма) КАК ПриходСумма,
	|		СУММА(ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Количество * ЦеныНоменклатурыСрезПоследних.Цена КАК ЧИСЛО(12, 2))) КАК ПриходСуммаРозн
	|	ИЗ
	|		Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|			ПО РасходнаяНакладнаяЗапасы.Ссылка.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОбслуживанияПокупателей.СрезПоследних(&ДатаСреза, ) КАК УсловияОбслуживанияПокупателейСрезПоследних
	|			ПО РасходнаяНакладнаяЗапасы.Ссылка.Контрагент = УсловияОбслуживанияПокупателейСрезПоследних.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ), ) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО РасходнаяНакладнаяЗапасы.Ссылка.Подразделение = ЦеныНоменклатурыСрезПоследних.Подразделение
	|				И РасходнаяНакладнаяЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				И (УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен)
	|	ГДЕ
	|		ЕСТЬNULL(УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен, ЗНАЧЕНИЕ(справочник.ТипыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(справочник.ТипыЦен.ПустаяСсылка)
	|		И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасходнаяНакладнаяЗапасы.Ссылка.Проведен = ИСТИНА
	|		И РасходнаяНакладнаяЗапасы.Ссылка.Контрагент = &Магазин
	|		И ВЫБОР
	|				КОГДА &ЕстьОрганизация
	|					ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И НЕ РасходнаяНакладнаяЗапасы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ_СписокИсключаемыхНакладных.Ссылка
	|					ИЗ
	|						ВТ_СписокИсключаемыхНакладных КАК ВТ_СписокИсключаемыхНакладных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяЗапасы.Ссылка.Номер,
	|		ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент) КАК РасходныеНакладные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвижения.ВозвратПоставщику),
	|	ВозвратыОтПокупателей.Контрагент,
	|	ВозвратыОтПокупателей.Комментарий,
	|	ВозвратыОтПокупателей.ПриходСумма,
	|	ВозвратыОтПокупателей.ПриходСуммаРозн,
	|	ВозвратыОтПокупателей.РасходСумма,
	|	ВозвратыОтПокупателей.РасходСуммаРозн,
	|	ИСТИНА
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент КАК Контрагент,
	|		ВозвратОтПокупателяЗапасы.Ссылка.Номер КАК Комментарий,
	|		СУММА(0) КАК ПриходСумма,
	|		СУММА(0) КАК ПриходСуммаРозн,
	|		СУММА(ВозвратОтПокупателяЗапасы.Сумма) КАК РасходСумма,
	|		СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(РекомендованныеЦены.Цена, 0) * ВозвратОтПокупателяЗапасы.Количество КАК ЧИСЛО(10, 2))) КАК РасходСуммаРозн
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних(, ) КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|			ПО ВозвратОтПокупателяЗапасы.Ссылка.Подразделение = ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОбслуживанияПокупателей.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ), ) КАК УсловияОбслуживанияПокупателейСрезПоследних
	|			ПО ВозвратОтПокупателяЗапасы.Ссылка.Контрагент = УсловияОбслуживанияПокупателейСрезПоследних.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ), ) КАК РекомендованныеЦены
	|			ПО ВозвратОтПокупателяЗапасы.Ссылка.Подразделение = РекомендованныеЦены.Подразделение
	|				И ВозвратОтПокупателяЗапасы.Номенклатура = РекомендованныеЦены.Номенклатура
	|				И (УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен = РекомендованныеЦены.ТипЦен)
	|	ГДЕ
	|		ЕСТЬNULL(УсловияОбслуживанияПокупателейСрезПоследних.РекомендованныйТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
	|		И ВозвратОтПокупателяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ВозвратОтПокупателяЗапасы.Ссылка.Проведен = ИСТИНА
	|		И ВозвратОтПокупателяЗапасы.Ссылка.Контрагент = &Магазин
	|		И ВЫБОР
	|				КОГДА &ЕстьОрганизация
	|					ТОГДА ВозвратОтПокупателяЗапасы.Ссылка.Организация = &Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И НЕ ВозвратОтПокупателяЗапасы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ_СписокИсключаемыхНакладных.Ссылка
	|					ИЗ
	|						ВТ_СписокИсключаемыхНакладных КАК ВТ_СписокИсключаемыхНакладных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПараметрыУчетаПоПодразделениямСрезПоследних.Контрагент,
	|		ВозвратОтПокупателяЗапасы.Ссылка.Номер) КАК ВозвратыОтПокупателей";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(Объект.Дата));
	запрос.УстановитьПараметр("КонецПериода", 	КонецДня(Объект.Дата));
	запрос.УстановитьПараметр("ДатаСреза", 		КонецДня(Объект.Дата));
	запрос.УстановитьПараметр("Магазин",		Объект.Магазин);
	запрос.УстановитьПараметр("Отдел",			Объект.Отдел);
	запрос.УстановитьПараметр("Организация",	Объект.Отдел.Организация);
	запрос.УстановитьПараметр("Подразделение",	Объект.Отдел.Подразделение);
	запрос.УстановитьПараметр("ТипЦен",			Объект.Отдел.Магазин.ТипЦен);
	запрос.УстановитьПараметр("ТипЦенСебестоимость",	Справочники.ТипыЦен.НайтиПоНаименованию("Категория 1"));
	запрос.УстановитьПараметр("ЕстьОрганизация",	ЗначениеЗаполнено(Объект.Отдел.Организация));
	запрос.УстановитьПараметр("СтрокиДокумента", СтрокиДокумента);
	
	выборка = запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		новаяСтрока = Объект.СтрокиДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	ЗаполнитьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура СтрокиДокументаПередНачаломИзменения(элемент, отказ)
	
	Если элемент.ТекущиеДанные.АвтоЗаполнение И элемент.ТекущийЭлемент.Имя <> "СтрокиДокументаКомментарий" Тогда
		отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
